# IPrintSetting Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPrintSetting Interface
Members See Also
---
An interface which represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public interface IPrintSetting
```

Visual Basic
---
```text
Public Interface IPrintSetting
```

Visual C++
---
```text
public interface class IPrintSetting
```

# See Also
IPrintSetting Members
Autodesk.Revit.DB Namespace